In [1]:
import pandas as pd
import sqlite3
import warnings
warnings.filterwarnings("ignore")

In [2]:
conn = sqlite3.connect("example2.db")
cur = conn.cursor()

In [3]:
cur.execute("select * from customer")
cur.fetchall()

[('Favio', 'Vazquez', 4300.0),
 ('Sri', 'Ambati', 3000.0),
 ('Sandeep', 'Desai', 20000.0),
 ('Anu', 'Gaur', 4020.5)]

In [4]:
df = pd.read_sql_query("select * from customer",conn)

In [5]:
df

      name last_name   income
0    Favio   Vazquez   4300.0
1      Sri    Ambati   3000.0
2  Sandeep     Desai  20000.0
3      Anu      Gaur   4020.5

In [6]:
df1 = pd.read_sql("select * from customer",conn)
df1

      name last_name   income
0    Favio   Vazquez   4300.0
1      Sri    Ambati   3000.0
2  Sandeep     Desai  20000.0
3      Anu      Gaur   4020.5

In [7]:
df2 = pd.read_csv("sample.csv")

In [8]:
df2

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

In [9]:
type(df2)

pandas.core.frame.DataFrame

In [10]:
df2.head(2)

    Name  Age
0  Favio   31
1  Marco   25

In [11]:
sample_df = pd.read_csv("sample.csv")

In [12]:
sample_df.to_sql("sample_table",conn,if_exists="replace",index=False)

5

In [13]:
pd.read_sql("select * from sample_table",conn)

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

In [15]:
def table_info(conn,cur):
    # prints all columns
    tables = cur.execute("select name from sqlite_master where type='table';").fetchall()
    for table_name in tables:
        table_name = table_name[0]
        table = pd.read_sql_query("select * from {} limit 0".format(table_name),conn)
        print(table_name)
        for col in table.columns:
            print("\t "+col)
            print()

table_info(conn,cur)

customer
	 name

	 last_name

	 income

sample_table
	 Name

	 Age